{
  "name": "Corinne Case",
  "url": "https://www.nypl.org/blog/author/288",
  "number": 288,
  "posts": [
    {
      "title": "Job Search: How to Avoid Interview Mishaps",
      "date": "July 30, 2009",
      "timestamp": 1248926400,
      "text": "Let’s face it, everyone dreads job interviews.  They are stressful, nerve-racking, and you really never know what is going to happen.  However, there are a few things that you can control which I will highlight below.\r\n\r\nFirst- look on the positive side of things: If you have been called in for an interview, that means the employer noticed your resume and thinks of you as a possible candidate for the job. You have most likely been picked out of a very large pool of candidates who applied to the same job- be proud of that!  After you let these positive feelings sink in- realize that the",
      "url": "https://www.nypl.org/blog/2009/07/30/job-search-how-avoid-interview-mishaps",
      "archive": "https://web.archive.org/web/20141214045836/http://www.nypl.org:80/blog/2009/07/30/job-search-how-avoid-interview-mishaps",
      "oldestArchive": "https://web.archive.org/web/20141214045836/http://www.nypl.org:80/blog/2009/07/30/job-search-how-avoid-interview-mishaps"
    },
    {
      "title": "Job Search: Not Your Average Job Search Sites",
      "date": "June 1, 2009",
      "timestamp": 1243828800,
      "text": "Searching for jobs has rapidly become an online process.  Knowing how to effectively search the web to apply for open positions is an essential skill that is necessary when looking for work. There are so many job search websites out there where companies post their vacancies.  Some popular ones you may have heard of or used are",
      "url": "https://www.nypl.org/blog/2009/06/01/job-search-not-your-average-job-search-sites",
      "archive": "https://web.archive.org/web/20211223212707/https://www.nypl.org/blog/2009/06/01/job-search-not-your-average-job-search-sites",
      "oldestArchive": "https://web.archive.org/web/20100806155311/http://www.nypl.org:80/blog/2009/06/01/job-search-not-your-average-job-search-sites"
    },
    {
      "title": "Job Search: Resume Tweakage",
      "date": "May 6, 2009",
      "timestamp": 1241582400,
      "text": "For a first time blog entry on the NYPL website, it makes sense for me to introduce my team and our intentions of this blog.  My team and I make up a small part of the New York Public Library’s Office of Staff Services (Human Resources), specializing in recruiting and employment.  Over the past few months as unemployment has increased, we have joined forces with other NYPL staff members in assisting library patrons in their job searches by running resume writing (and other job related)",
      "url": "https://www.nypl.org/blog/2009/05/06/job-search-resume-tweakage",
      "archive": "https://web.archive.org/web/20211223212823/https://www.nypl.org/blog/2009/05/06/job-search-resume-tweakage",
      "oldestArchive": "https://web.archive.org/web/20141202230428/http://www.nypl.org:80/blog/2009/05/06/job-search-resume-tweakage"
    }
  ]
}